from userbot import iqthon

from ..core.managers import edit_or_reply
@iqthon.on(admin_cmd(pattern="رموز1(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""`𓅄 𓅅 𓅆 𓅇 𓅈 𓅉 𓅊 𓅋 𓅌 𓅍 𓅎 𓅏 𓅐 𓅑 𓅒 𓅓 𓅔𓅕 𓅖 𓅗 𓅘 𓅙 𓅚 𓅛 𓅜 𓅝 𓅞 𓅟 𓅠 𓅡 𓅢 𓅣 𓅤 𓅥 𓅦 𓅧 𓅨 𓅩 𓅫 𓅬 𓅭 𓅮 𓅯 𓅰 𓅱 𓅲 𓅳 𓅴 
𓅵 𓅶 𓅷 𓅸 𓅹 𓅺 𓅻 
 ☤ 𓅾 𓅿 𓆀 𓆁 𓆂
𓀀 𓀁 𓀂 𓀃 𓀄 𓀅 𓀆 𓀇 𓀈 𓀉 𓀊 𓀋 𓀌 𓀍 𓀎 𓀏 𓀐 𓀑 𓀒 𓀓 𓀔 𓀕 𓀖 𓀗 𓀘 𓀙 𓀚 𓀛 𓀜 𓀝 𓀞 𓀟 𓀠 𓀡 𓀢 𓀣 𓀤 𓀥 𓀦 𓀧 𓀨 𓀩 𓀪 𓀫 𓀬 𓀭 𓀮 𓀯 𓀰 𓀱 𓀲 𓀳 𓀴 𓀵 𓀶 𓀷 𓀸 𓀹 𓀺 𓀻 𓀼 𓀽 𓀾 𓀿 𓁀 𓁁 𓁂 𓁃 𓁄 𓁅 𓁆 𓁇 𓁈 𓁉 𓁊 𓁋 𓁌 𓁍 𓁎 𓁏 𓁐 𓁑 𓁒 𓁓 𓁔 𓁕 𓁖 𓁗 𓁘 𓁙 𓁚 𓁛 𓁜 𓁝 𓁞 𓁟 𓁠 𓁡 𓁢 𓁣 𓁤 𓁥 𓁦 𓁧 𓁨 𓁩 𓁪 𓁫 𓁬 𓁭 𓁮 𓁯 𓁰 𓁱 𓁲 𓁳 𓁴 𓁵 𓁶 𓁷 𓁸 𓁹 𓁺 𓁻 𓁼 𓁽 𓁾 𓁿 𓂀𓂅 𓂆 𓂇 𓂈 𓂉 𓂊 𓂋 𓂌 𓂍 𓂎 𓂏 𓂐 𓂑 𓂒 𓂓 𓂔 𓂕 𓂖 𓂗 𓂘 𓂙 𓂚 𓂛 𓂜 𓂝 𓂞 𓂟 𓂠 𓂡 𓂢 𓂣 𓂤 𓂥 𓂦 𓂧 𓂨 𓂩 𓂪 𓂫 𓂬 𓂭 𓂮 𓂯 𓂰 𓂱 𓂲 𓂳 𓂴 𓂵 𓂶 𓂷 𓂸 𓂹 𓂺 𓂻 𓂼 𓂽 𓂾 𓂿 𓃀 𓃁 𓃂 𓃃 𓃅 𓃆 𓃇 𓃈 𓃉 𓃊 𓃋 𓃌 𓃍 𓃎 𓃏 𓃐 𓃑 𓃒 𓃓 𓃔 𓃕 𓃖 𓃗 𓃘 𓃙 𓃚 𓃛 𓃜 𓃝 𓃞 𓃟 𓃠 𓃡 𓃢 𓃣 𓃤 𓃥 𓃦 𓃧 𓃨 𓃩 𓃪 𓃫 𓃬 𓃭 𓃮 𓃯 𓃰 𓃱 𓃲 𓃳 𓃴 𓃵 𓃶 𓃷 𓃸 𓃹 𓃺 𓃻 𓃼 𓃽 𓃾 𓃿 𓄀 𓄁 𓄂 𓄃 𓄄 𓄅 𓄆 𓄇 𓄈 𓄉 𓄊 𓄋 𓄌 𓄍 𓄎 𓄏 𓄐 𓄑 𓄒 𓄓 𓄔 𓄕 𓄖 𓄙 𓄚 𓄛 𓄜 𓄝 𓄞 𓄟 𓄠 𓄡 𓄢 𓄣 𓄤 𓄥 𓄦 𓄧 𓄨 𓄩 𓄪 𓄫 𓄬 𓄭 𓄮 𓄯 𓄰 𓄱 𓄲 𓄳 𓄴 𓄵 𓄶 𓄷 𓄸 𓄹 𓄺   𓄼 𓄽 𓄾 𓄿 𓅀 𓅁 𓅂 𓅃 𓅄 𓅅 𓅆 𓅇 𓅈 𓅉 𓅊 𓅋 𓅌 𓅍 𓅎 𓅏 𓅐 𓅑 𓅒 𓅓 𓅔 𓅕 𓅖 𓅗 𓅘 𓅙 𓅚 𓅛 𓅜 𓅝 𓅞 𓅟 𓅠 𓅡 𓅢 𓅣 𓅤 𓅥 𓅦 𓅧 𓅨 𓅩 𓅪 𓅫 𓅬 𓅭 𓅮 𓅯 𓅰 𓅱 𓅲 𓅳 𓅴 𓅵 𓅶 𓅷 𓅸 𓅹 𓅺 𓅻 𓅼 𓅽 𓅾 𓅿 𓆀 𓆁 𓆂 𓆃 𓆄 𓆅 𓆆 𓆇 𓆈 𓆉 𓆊 𓆋 𓆌 𓆍 𓆎 𓆐 𓆑 𓆒 𓆓 𓆔 𓆕 𓆖 𓆗 𓆘 𓆙 𓆚 𓆛 𓆜 𓆝 𓆞 𓆟 𓆠 𓆡 𓆢 𓆣 𓆤 𓆥 𓆦 𓆧 𓆨 𓆩𓆪 𓆫 𓆬 𓆭 𓆮 𓆯 𓆰 𓆱 𓆲 𓆳 𓆴 𓆵 𓆶 𓆷 𓆸 𓆹 𓆺 𓆻 𓆼 𓆽 𓆾 𓆿 𓇀 𓇁 𓇂 𓇃 𓇄 𓇅 𓇆 𓇇 𓇈 𓇉 𓇊 𓇋 𓇌 𓇍 𓇎 𓇏 𓇐 𓇑 𓇒 𓇓 𓇔 𓇕 𓇖 𓇗 𓇘 𓇙 𓇚 𓇛 𓇜 𓇝 𓇞 𓇟 𓇠 𓇡 𓇢 𓇣 𓇤 𓇥 𓇦 𓇧 𓇨 𓇩 𓇪 𓇫 𓇬 𓇭 𓇮 𓇯 𓇰 𓇱 𓇲 𓇳 𓇴 𓇵 𓇶 𓇷 𓇸 𓇹 𓇺 𓇻 𓇼 𓇾 𓇿 𓈀 𓈁 𓈂 𓈃 𓈄 𓈅 𓈆 𓈇 𓈈 𓈉 𓈊 𓈋 𓈌 𓈍 𓈎 𓈏 𓈐 𓈑 𓈒 𓈓 𓈔 𓈕 𓈖 𓈗 𓈘 𓈙 𓈚 𓈛 𓈜 𓈝 𓈞 𓈟 𓈠 𓈡 𓈢 𓈣 𓈤  𓈥 𓈦 𓈧 𓈨 𓈩 𓈪 𓈫 𓈬 𓈭 𓈮 𓈯 𓈰 𓈱 𓈲 𓈳 𓈴 𓈵 𓈶 𓈷 𓈸 𓈹 𓈺 𓈻 𓈼 𓈽 𓈾 𓈿 𓉀 𓉁 𓉂 𓉃 𓉄 𓉅 𓉆 𓉇 𓉈 𓉉 𓉊 𓉋 𓉌 𓉍 𓉎 𓉏 𓉐 𓉑 𓉒 𓉓 𓉔 𓉕 𓉖 𓉗 𓉘 𓉙 𓉚 𓉛 𓉜 𓉝 𓉞 𓉟 𓉠 𓉡 𓉢 𓉣 𓉤 𓉥 𓉦 𓉧 𓉨 𓉩 𓉪 𓉫 𓉬 𓉭 𓉮 𓉯 𓉰 𓉱 𓉲 𓉳 𓉴 𓉵 𓉶 𓉷 𓉸 𓉹 𓉺 𓉻 𓉼 𓉽 𓉾 𓉿 𓊀 𓊁 𓊂 𓊃 𓊄 𓊅 𓊈 𓊉 𓊊 𓊋 𓊌 𓊍 𓊎 𓊏 𓊐 𓊑 𓊒 ?? 𓊔 𓊕 ?? ?? 𓊘 𓊙 𓊚 𓊛 𓊜 𓊝 𓊞 𓊟 𓊠 𓊡 𓊢 𓊣 𓊤 𓊥 𓊦 𓊧 𓊨 𓊩 𓊪 𓊫 𓊬 𓊭 𓊮 𓊯 𓊰 𓊱 𓊲 𓊳 𓊴 𓊵 𓊶 𓊷 𓊸 𓊹 𓊺 𓊻 𓊼 ?? ?? 𓊿 𓋀 𓋁 𓋂 𓋃 𓋄 𓋅 𓋆 𓋇 𓋈 𓋉 𓋊 𓋋 𓋌 𓋍 𓋎 𓋏 𓋐 𓋑 𓋒 𓋓 𓋔 𓋕 𓋖 𓋗 𓋘 𓋙 𓋚 𓋛 𓋜 𓋝 𓋞 𓋟 𓌰 𓌱 𓌲 𓌳 𓌴 𓌵 𓌶 𓌷 𓌸 𓌹 𓌺 𓌻 𓌼 𓌽 𓌾 𓌿 𓍀 𓍁 𓍂 𓍃 𓍄 𓍅 𓍆 𓍇 𓍈 𓍉 𓍊 𓍋 𓍌 𓍍 𓍎 𓍏 𓍐 𓍑 𓍒 𓍓 𓍔 𓍕 𓍖 𓍗 𓍘 𓍙 𓍚 𓍛 𓍜 𓍝 𓍞 𓍟 𓍠 𓍡 𓍢 𓍣 𓍤 𓍥 𓍦 𓍧 𓍨 𓍩 𓍪 𓍫 𓍬 𓍭 𓍮 𓍯 𓍰 𓍱 𓍲 𓍳 𓍴 𓍵 𓍶 𓍷 𓍸 𓍹 𓍺 𓍻 𓍼 𓍽 𓍾 𓍿 𓎀 𓎁 𓎂 𓎃 𓎄 𓎅 𓎆 𓎇 𓎈 𓎉 𓎊 𓎋 𓎌 𓎍 𓎎 𓎏 𓎐 𓎑 𓎒 𓎓 𓎔 𓎕 𓎖 𓎗 𓎘 𓎙 𓎚 𓎛 𓎜 𓎝 𓎞 𓎟 𓎠 𓎡 𓏋 𓏌 𓏍 𓏎 𓏏 𓏐 𓏑 𓏒 𓏓 
 𓏕 𓏖 𓏗 𓏘 𓏙 𓏚 𓏛 𓏜 𓏝 𓏞 𓏟 𓏠 𓏡 𓏢 𓏣 𓏤 𓏥 𓏦 𓏧 𓏨 𓏩 𓏪 𓏫 𓏬 𓏭 𓏮 𓏯 𓏰 𓏱 𓏲 𓏳 𓏴 𓏶 𓏷 𓏸 𓏹 𓏺 𓏻 𓏼 𓏽 𓏾 𓏿 𓐀 𓐁 𓐂 𓐃 𓐄 𓐅 𓐆
- 𖣨 ، ෴ ، 𖡺  ، 𖣐 ، ✜ ، ✘ ، 𖡻 ،
- ༄ ، ༺༻ ، ༽༼ ،  ╰☆╮،  
- ɵ̷᷄ˬɵ̷᷅ ، ⠉̮⃝ ، ࿇࿆ ، ꔚ، ま ، ☓ ،
𓆉 . 𓃠 .𓅿 . 𓃠 . 𓃒 . 𓅰 . 𓃱 . 𓅓 . 𐂃  . ꕥ  . ⌘ . ♾ .    ꙰  .  . ᤑ .  ﾂ .
✦ ,✫ ,✯, ✮ ,✭ ,✰, ✬ ,✧, ✤, ❅ , 𒀭,✵ , ✶ , ✷ , ✸ , ✹ ,⧫, . 𐂂 
-〘 𖢐 ، 𒍦 ، 𒍧 ، 𖢣 ، 𝁫 ، 𒍭 ، 𝁅 ، 𝁴 ، 𒍮 ، 𝁵 ، 𝀄 ، 𓏶 ، 𓏧 ، 𓏷 ، 𓏯 ، 𓏴 ، 𓏳 ، 𓏬 ، 𓏦 ، 𓏵 ، 𓏱 ، ᳱ ، ᯼ ، 𐃕 ، ᯥ ، ᯤ ، ᯾ ، ᳶ ، ᯌ ، ᢆ ،
 ᥦ ، ᨙ ، ᨚ  ، ᨔ  ، ⏢ ، ⍨ ، ⍃ ، ⏃ ، ⍦ ، ⏕ ، ⏤ ، ⏁ ، ⏂ ، ⏆ ، ⌳ ، ࿅ ، ࿕ ، ࿇ ، ᚙ ، ࿊ ، ࿈ ، ྿ ،
 ࿂ ، ࿑ ،  ᛥ ، ࿄ ، 𐀁 ، 𐀪 ، 𐀔 ، 𐀴 ، 𐀤 ، 𐀦 ، 𐀂 ، 𐀣 ، 𐀢 ، 𐀶 ، 𐀷 ، 𐂭 ، 𐂦 ، 𐂐 ، 𐂅 ، 𐂡 ، 𐂢 ، 𐂠 ، 𐂓 ، 𐂑 ، 𐃸 ، 𐃶 ، 𐂴 ، 𐃭 ، 𐃳 ، 𐃣 ، 𐂰 ، 𐃟 ، 𐃐 ، 𐃙 ، 𐃀 ، 𐇮 ، 𐇹 ، 𐇲 ، 𐇩 ، 𐇪 ، 𐇶 ، 𐇻 ، 𐇡 ، 𐇸 ، 𐇣 ، 𐇤 ، 𐎅 ، 𐏍 ، 𐎃 ، 𐏒 ، 𐎄 ، 𐏕 〙.
╔ ╗. 𓌹  𓌺 .〝  〞. ‹ ›  .「  」.〖 〗. 《》 .  < > . « »  . ﹄﹃
₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₀
𝟏 𝟐 𝟑 𝟒 𝟓 𝟔 𝟕 𝟖 𝟗 𝟎
𝟭 𝟮 𝟯 𝟰 𝟱 𝟲 𝟳 𝟴 𝟵 𝟬
①②③④⑤⑥⑦⑧⑨⓪
❶❷❸❹❺❻❼❽❾⓿
⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴ `""")
@iqthon.on(admin_cmd(pattern="رموز2(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""`———————×———————
 𝟶 𝟷 𝟸 𝟹 𝟺 𝟻 𝟼 𝟽 𝟾  𝟿
 ? 𝟙  𝟚  𝟛  𝟜  𝟝  𝟞  𝟟  𝟠 𝟡
 𝟬 𝟭  𝟮  𝟯  𝟰  𝟱   𝟲  𝟳  𝟴  𝟵  
 𝟎  𝟏  𝟐  𝟑  𝟒   𝟓   𝟔  𝟕   𝟖   𝟗
０ １ ２ ３ ４ ５ ６ ７８９
———————×———————
ᾋ ᾌ ᾍ ᾎ ᾏ ᾐ ᾑ ᾒ ᾓ ᾔ ᾕ ᾖ ᾗ ᾘ ᾙ ᾚ ᾛ ᾜ ᾝ ᾞ ᾟ ᾠ ᾡ ᾢ ᾣ ᾤ ᾥ ᾦ ᾧ ᾨ ᾩ ᾪ ᾫ ᾬ ᾭ ᾮ ᾯ ᾰ ᾱ ᾲ ᾳ ᾴ ᾶ ᾷ Ᾰ Ᾱ Ὰ Ά ᾼ ᾽ ι ᾿ ῀ ῁ ῂ ῃ ῄ ῆ ῇ Ὲ Έ Ὴ Ή ῌ ῍ ῎ ῏ ῐ ῑ ῒ ΐ ῖ ῗ Ῐ Ῑ Ὶ Ί ῝ ῞ ῟ ῠ ῡ ῢ ΰ ῤ ῥ ῦ ῧ Ῠ Ῡ Ὺ Ύ Ῥ ῭ ΅ ` ῲ ῳ ῴ ῶ ῷ Ὸ Ό Ὼ Ώ ῼ ´ ῾ ῿                         ‌ ‍ ‎ ‏ ‐ ‑ ‒ – — ― ‖ ‗ ‘ ’ ‚ ‛ “ ” „ ‟ † ‡ • ‣ ․ ‥ … ‧       ‰ ‱ ′ ″ ‴ ‵ ‶ ‷ ‸ ‹ › ※  ‽ ‾ ‿ ⁀ ⁁ ⁂ ⁃ ⁄ ⁅ ⁆ ⁇  ⁊ ⁋ ⁌ ⁍ ⁎ ⁏ ⁐ ⁑ ⁒ ⁓ ⁔ ⁕ ⁖ ⁗ ⁘ ⁙ ⁚ ⁛ ⁜ ⁝ ⁞   ⁠ ⁡ ⁢ ⁣ ⁤ ⁥ ‌ ‌ ⁨ ⁩ ⁪ ⁫ ⁬ ⁭ ⁮ ⁯ ⁰ ⁱ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁿ ₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₐ ₑ ₒ ₓ ₕ ₖ ₗ ₘ ₙ ₚ ₛ ₜ ₝ ₞ ₟ ₠ ₡ ₢ ₣ ₤ ₥ ₦ ₧ ₨ ₩ ₪ ₫ € ₭ ₮ ₯ ₰ ₱ ₲ ₳ ₴ ₵ ℀ ℁ ℂ ℃ ℄ ℅ ℆ ℇ ℈ ℉ ℊ ℋ ℌ ℍ ℎ ℏ ℐ ℑ ℒ ℓ ℔ ℕ № ℗ ℘ ℙ ℚ ℛ ℜ ℝ ℞ ℟ ℠ ℡ ™ ℣ ℤ ℥ Ω ℧ ℨ ℩ K Å ℬ ℭ ℮ ℯ ℰ ℱ Ⅎ ℳ ℴ ℵ ℶ ℷ ℸ  ℺ ℻ ℼ ℽ ℾ ℿ ⅀ ⅁ ⅂ ⅃ ⅄ ⅅ ⅆ ⅇ ⅈ ⅉ ⅊ ⅋ ⅌ ⅍ ⅎ ⅏ ⅐ ⅑ ⅒ ⅓ ⅔ ⅕ ⅖ ⅗ ⅘ ⅙ ⅚ ⅛ ⅜ ⅝ ⅞ ↀ ↁ ↂ Ↄ ↉ ↊ ↋ ← ↑ → ↓  ↚ ↛ ↜ ↝ ↞ ↟ ↠ ↡ ↢ ↣ ↤ ↥ ↦ ↧ ↨  ↫ ↬ ↭ ↮ ↯ ↰ ↱ ↲ ↳ ↴ ↵ ↶ ↷ ↸ ↹ ↺ ↻ ↼ ↽ ↾ ↿ ⇀ ⇁ ⇂ ⇃ ⇄ ⇅ ⇆ ⇇ ⇈ ⇉ ⇊ ⇋ ⇌ ⇍ ⇎ ⇏ ⇐ ⇑ ⇒ ⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇞ ⇟ ⇠ ⇡ ⇢ ⇣ ⇤ ⇥ ⇦ ⇧ ⇨ ⇩ ⇪ ⇫ ⇬ ⇭ ⇮ ⇯ ⇰ ⇱ ⇲ ⇳ ⇴ ⇵ ⇶ ⇷ ⇸ ⇹ ⇺ ⇻ ⇼ ⇽ ⇾ ⇿ ∀ ∁ ∂ ∃ ∄ ∅ ∆ ∇ ∈ ∉ ∊ ∋ ∌ ∍ ∎ ∏ ∐ ∑ − ∓ ∔ ∕ ∖ ∗ ∘ ∙ √ ∛ ∜ ∝ ∞ ∟ ∠ ∡ ∢ ∣ ∤ ∥ ∦ ∧ ∨ ∩ ∪ ∫ ∬ ∭ ∮ ∯ ∰ ∱ ∲ ∳ ∴ ∵ ∶ ∷ ∸ ∹ ∺ ∻ ∼ ∽ ∾ ∿ ≀ ≁ ≂ ≃ ≄ ≅ ≆ ≇ ≈ ≉ ≊ ≋ ≌ ≍ ≎ ≏ ≐ ≑ ≒ ≓ ≔ ≕ ≖ ≗ ≘ ≙ ≚ ≛ ≜ ≝ ≞ ≟ ≠ ≡ ≢ ≣ ≤ ≥ ≦ ≧ ≨ ≩ ≪ ≫ ≬ ≭ ≮ ≯ ≰ ≱ ≲ ≳ ≴ ≵ ≶ ≷ ≸ ≹ ≺ ≻ ≼ ≽ ≾ ≿ ⊀ ⊁ ⊂ ⊃ ⊄ ⊅ ⊆ ⊇ ⊈ ⊉ ⊊ ⊋ ⊌ ⊍ ⊎ ⊏ ⊐ ⊑ ⊒ ⊓ ⊔ ⊕ ⊖ ⊗ ⊘ ⊙ ⊚ ⊛ ⊜ ⊝ ⊞ ⊟ ⊠ ⊡ ⊢ ⊣ ⊤ ⊥ ⊦ ⊧ ⊨ ⊩ ⊪ ⊫ ⊬ ⊭ ⊮ ⊯ ⊰ ⊱ ⊲ ⊳ ⊴ ⊵ ⊶ ⊷ ⊸ ⊹ ⊺ ⊻ ⊼ ⊽ ⊾ ⊿ ⋀ ⋁ ⋂ ⋃ ⋄ ⋅ ⋆ ⋇ ⋈ ⋉ ⋊ ⋋ ⋌ ⋍ ⋎ ⋏ ⋐ ⋑ ⋒ ⋓ ⋔ ⋕ ⋖ ⋗ ⋘ ⋙ ⋚ ⋛ ⋜ ⋝ ⋞ ⋟ ⋠ ⋡ ⋢ ⋣ ⋤ ⋥ ⋦ ⋧ ⋨ ⋩ ⋪ ⋫ ⋬ ⋭ ⋮ ⋯ ⋰ ⋱ ⋲ ⋳ ⋴ ⋵ ⋶ ⋷ ⋸ ⋹ ⋺ ⋻ ⋼ ⋽ ⋾ ⋿ ⌀ ⌁ ⌂ ⌃ ⌄ ⌅ ⌆ ⌇ ⌈ ⌉ ⌊ ⌋ ⌌ ⌍ ⌎ ⌏ ⌐ ⌑ ⌒ ⌓ ⌔ ⌕ ⌖ ⌗ ⌘ ⌙  ⌛️ ⌜ ⌝ ⌞ ⌟ ⌠ ⌡ ⌢ ⌣ ⌤ ⌥ ⌦ ⌧ ⌨️ 〈 〉 ⌫ ⌬ ⌭ ⌮ ⌯ ⌰ ⌱ ⌲ ⌳ ⌴ ⌵ ⌶ ⌷ ⌸ ⌹ ⌺ ⌻ ⌼ ⌽ ⌾ ⌿ ⍀ ⍁ ⍂ ⍃ ⍄ ⍅ ⍆ ⍇ ⍈ ⍉ ⍊ ⍋ ⍌ ⍍ ⍎ ⍏ ⍐ ⍑ ⍒ ⍓ ⍔ ⍕ ⍖ ⍗ ⍘ ⍙ ⍚ ⍛ ⍜ ⍝ ⍞ ⍟ ⍠ ⍡ ⍢ ⍣ ⍤ ⍥ ⍦ ⍧ ⍨ ⍩ ⍪ ⍫ ⍬ ⍭ ⍮ ⍯ ⍰ ⍱ ⍲ ⍳ ⍴ ⍵ ⍶ ⍷ ⍸ ⍹ ⍺ ⍻ ⍼ ⍽ ⍾ ⍿ ⎀ ⎁ ⎂ ⎃ ⎄ ⎅ ⎆ ⎇ ⎈ ⎉ ⎊ ⎋ ⎌ ⎍ ⎎ ⎏ ⎐ ⎑ ⎒ ⎓ ⎔ ⎕ ⎖ ⎗ ⎘ ⎙ ⎚ ⎛ ⎜ ⎝ ⎞ ⎟ ⎠ ⎡ ⎢ ⎣ ⎤ ⎥ ⎦ ⎧ ⎨ ⎩ ⎪ ⎫ ⎬ ⎭ ⎮ ⎯ ⎰ ⎱ ⎲ ⎳ ⎴ ⎵ ⎶ ⎷ ⎸ ⎹ ⎺ ⎻ ⎼ ⎽ ⎾ ⎿ ⏀ ⏁ ⏂ ⏃ ⏄ ⏅ ⏆ ⏇ ⏈ ⏉ ⏋ ⏌ ⏍ ⏎  ⏐ ⏑ ⏒ ⏓ ⏔ ⏕ ⏖ ⏗ ⏘ ⏙ ⏚ ⏛ ⏜ ⏝ ⏞ ⏟ ⏠ ⏡ ⏢ ⏣ ⏤ ⏥ ⏦ ␋ ␢ ␣ ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳ ⑴ ⑵ ⑶ ⑷ ⑸ ⑹ ⑺ ⑻ ⑼ ⑽ ⑾ ⑿ ⒀ ⒁ ⒂ ⒃ ⒄ ⒅ ⒆ ⒇ ⒈ ⒉ ⒊ ⒋ ⒌ ⒍ ⒎ ⒏ ⒐ ⒑ ⒒ ⒓ ⒔ ⒕ ⒖ ⒗ ⒘ ⒙ ⒚ ⒛ ⒜ ⒝ ⒞ ⒟ ⒠ ⒡ ⒢ ⒣ ⒤ ⒥ ⒦ ⒧ ⒨ ⒩ ⒪ ⒫ ⒬ ⒭ ⒮ ⒯ ⒰ ⒱ ⒲ ⒳ ⒴ ⒵ Ⓐ Ⓑ Ⓒ Ⓓ Ⓔ Ⓕ Ⓖ Ⓗ Ⓘ Ⓙ Ⓚ Ⓛ  Ⓝ Ⓞ Ⓟ Ⓠ Ⓡ Ⓢ Ⓣ Ⓤ Ⓥ Ⓦ Ⓧ Ⓨ Ⓩ ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ ⓪ ⓫ ⓬ ⓭ ⓮ ⓯ ⓰ ⓱ ⓲ ⓳ ⓴ ⓵ ⓶ ⓷ ⓸ ⓹ ⓺ ⓻ ⓼ ⓽ ⓾ ⓿ ─ ━ │ ┃ ┄ ┅ ┆ ┇ ┈ ┉ ┊ ┋ ┌ ┍ ┎ ┏ ┐ ┑ ┒ ┓ └ ┕ ┖ ┗ ┘ ┙ ┚ ┛ ├ ┝ ┞ ┟ ┠ ┡ ┢ ┣ ┤ ┥ ┦ ┧ ┨ ┩ ┪ ┫ ┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻ ┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╌ ╍ ╎ ╏ ═ ║ ╒ ╓ ╔ ╕ ╖ ╗ ╘ ╙ ╚ ╛ ╜ ╝ ╞ ╟ ╠ ╡ ╢ ╣ ╤ ╥ ╦ ╧ ╨ ╩ ╪ ╫ ╬ ╬﹌ ╭ ╮ ╯ ╰ ╰☆╮ ╱ ╲ ╳ ╴ ╵ ╶ ╷ ╸ ╹ ╺ ╻ ╼ ╽ ╾ ╿ ▀ ▁ ▂ ▃ ▄ ▅ ▆ ▇ █ ▉ ▊ ▋ ▌ ▍ ▎ ▏ ▐ ░ ▒ ▓ ▔ ▕ ▖ ▗ ▘ ▙ ▚ ▛ ▜ ▝ ▞ ▟ ■ □ ▢ ▣ ▤ ▥ ▦ ▧ ▨ ▩ ▪️ ▫️ ▬ ▭ ▮ ▯ ▰ ▱ ▲ △ ▴ ▵ ▷ ▸ ▹ ► ▻ ▼ ▽ ▾ ▿  ◁ ◂ ◃ ◄ ◅ ◆ ◇ ◈ ◉ ◊ ○ ◌ ◍ ◎ ● ◐ ◑ ◒ ◓ ◔ ◔ʊ ◕ ◖ ◗ ◘ ◙ ◚ ◛ ◜ ◝ ◞ ◟ ◠ ◡ ◢ ◣ ◤ ◥ ◦ ◧ ◨ ◩ ◪ ◫ ◬ ◭ ◮ ◯ ◰ ◱ ◲ ◳ ◴ ◵ ◶ ◷ ◸ ◹ ◺  ☓ ☰ ☱ ☲ ☳ ☴ ☵ ☶ ☷  ♡ ♢   ♰ ♱  ⚆   ⚊ ⚋ ⚌ ⚍ ⚎ ⚏  ✐ ✑  ✓ ✔️ ✕ ✖️ ✗ ✘ ✙ ✚ ✛ ✜  ✞ ✟ ✠ ✢ ✣ ✤ ✥ ✦ ✧ ✧♱ ✩ ✪ ✫ ✬ ✭ ✮ ✯ ✰ ✱ ✲  ✵ ✶ ✷ ✸ ✹ ✺ ✻ ✼ ✽ ✾ ✿ ❀ ❁ ❂ ❃ ❅ ❆ ❈ ❉ ❊ ❋ ❍ ❏ ❐ ❑ ❒ ❖  ❘ ❙ ❚ ❛ ❜ ❝ ❞ ❡ ❢ ❥ ❦ ❧ ❨ ❩ ❪ ❫ ❬ ❭ ❮ ❯ ❰ ❱ ❲ ❳ ❴ ❵ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ ➇ ➈ ➉ ➊ ➋ ➌ ➍ ➎ ➏ ➐➑ ➒ ➓ ➔ ➘ ➙ ➚ ➛ ➜ ➝ ➞ ➟ ➠  ➢ ➣ ➤ ➥ ➦ ➧ ➨ ➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ ➲ ➳ ➴ ➵ ➶ ➷ ➸ ➹ ➺ ➻ ➼ ➽ ➾ ⟀ ⟁ ⟂ ⟃ ⟄ ⟇ ⟈ ⟉ ⟊ ⟐ ⟑ ⟒ ⟓ ⟔ ⟕ ⟖ ⟗ ⟘ ⟙ ⟚ ⟛ ⟜ ⟝ ⟞ ⟟ ⟠ ⟡ ⟢ ⟣ ⟤ ⟥ ⟦ ⟧ ⟨ ⟩ ⟪ ⟫ ⟰ ⟱ ⟲ ⟳ ⟴ ⟵ ⟶ ⟷ ⟸ ⟹ ⟺ ⟻ ⟼ ⟽ ⟾ ⟿ ⤀ ⤁ ⤂ ⤃ ⤄ ⤅ ⤆ ⤇ ⤈ ⤉ ⤊ ⤋ ⤌ ⤍ ⤎ ⤏ ⤐ ⤑ ⤒ ⤓ ⤔ ⤕ ⤖ ⤗ ⤘ ⤙ ⤚ ⤛ ⤜ ⤝ ⤞ ⤟ ⤠ ⤡ ⤢ ⤣ ⤤ ⤥ ⤦ ⤧ ⤨ ⤩ ⤪ ⤫ ⤬ ⤭ ⤮ ⤯ ⤰ ⤱ ⤲ ⤳ ⤶ ⤷ ⤸ ⤹ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⥂ ⥃ ⥄ ⥅ ⥆ ⥇ ⥈ ⥉ ⥊ ⥋ ⥌ ⥍ ⥎ ⥏ ⥐ ⥑ ⥒ ⥓ ⥔ ⥕ ⥖ ⥗ ⥘ ⥙ ⥚ ⥛ ⥜ ⥝ ⥞ ⥟ ⥠ ⥡ ⥢ ⥣ ⥤ ⥥ ⥦ ⥧ ⥨ ⥩ ⥪ ⥫ ⥬ ⥭ ⥮ ⥯ ⥰ ⥱ ⥲ ⥳ ⥴ ⥵ ⥶ ⥷ ⥸ ⥹ ⥺ ⥻ ⥼ ⥽ ⥾ ⥿ ⦀ ⦁ ⦂ ⦃ ⦄ ⦅ ⦆ ⦇ ⦈ ⦉ ⦊ ⦋ ⦌ ⦍ ⦎ ⦏ ⦐ ⦑ ⦒ ⦓ ⦔ ⦕ ⦖ ⦗ ⦘ ⦙ ⦚ ⦛ ⦜ ⦝ ⦞ ⦟ ⦠ ⦡ ⦢ ⦣ ⦤ ⦥ ⦦ ⦧ ⦨ ⦩ ⦪ ⦫ ⦬ ⦭ ⦮ ⦯ ⦰ ⦱ ⦲ ⦳ ⦴ ⦵ ⦶ ⦷ ⦸ ⦹ ⦺ ⦻ ⦼ ⦽ ⦾ ⦿ ⧀ ⧁ ⧂ ⧃ ⧄ ⧅ ⧆ ⧇ ⧈ ⧉ ⧊ ⧋ ⧌ ⧍ ⧎ ⧏ ⧐ ⧑ ⧒ ⧓ ⧔ ⧕ ⧖ ⧗ ⧘ ⧙ ⧚ ⧛ ⧜ ⧝ ⧞ ⧟ ⧡ ⧢ ⧣ ⧤ ⧥ ⧦ ⧧ ⧨ ⧩ ⧪ ⧫ ⧬ ⧭ ⧮ ⧯ ⧰ ⧱ ⧲ ⧳ ⧴ ⧵ ⧶ ⧷ ⧸ ⧹ ⧺ɷ
﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎ `""")
@iqthon.on(admin_cmd(pattern="تمبلريه(?: |$)(.*)"))
async def iq(event):
     await edit_or_reply(event, "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⎈ ⦙  قائـمه اوامر الزغرفه :** \n⎈ ⦙  `.المواليد ` \n⎈ ⦙  `.اشهر مزغرفه` \n⎈ ⦙  `.الاختصارات` \n⎈ ⦙  `.البايو` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻",)
@iqthon.on(admin_cmd(pattern="البايو(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event, "**⎈ ⦙  - 𝑩𝑰𝑶 𝑳𝑰𝑺𝑻 : **\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⎈ ⦙  قائـمه البايو :** \n⎈ ⦙  `.بايو1 ` \n⎈ ⦙  `.بايو2` \n⎈ ⦙  `.بايو3 ` \n⎈ ⦙  `.بايو4 ` \n⎈ ⦙  `.بايو5` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻")
@iqthon.on(admin_cmd(pattern="الاختصارات(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event, "**⎈ ⦙  - 𝑺𝑯𝑶𝑹𝑻𝑪𝑼𝑻𝑺 : **\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n **⎈ ⦙  قائـمه الاختصارات :** \n⎈ ⦙  `.اختصارات1 ` \n⎈ ⦙  `.اختصارات2` \n⎈ ⦙  `.اختصارات3 ` \n⎈ ⦙  `.اختصارات4 ` \n⎈ ⦙  `.اختصارات5` \n 𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻")
@iqthon.on(admin_cmd(pattern="اشهر مزغرفه(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "-₁₉₉₀\n"
                "-₁₉₉₁\n"
                "-₁₉₉₂\n"
                "-₁₉₉₃\n"
                "-₁₉₉₄\n"
                "-₁₉₉₅\n"
                "-₁₉₉₆\n"
                "-₁₉₉₇\n"
                "-₁₉₉₈\n"
                "-₁₉₉₉\n"
                "-₂₀₀₀\n"
                "-₂₀₀₁\n"
                "-₂₀₀₂\n"
                "-₂₀₀₃\n"
                "-₂₀₀₄\n"
                "-₂₀₀₅-\n"
                "-₂₀₀₆\n"
                "-₂₀₀₇\n"
                "---\n"
                "-𝒋𝒂𝒏𝒖𝒂𝒓𝒚.💞\n"
                "-𝒇𝒆𝒃𝒓𝒖𝒂𝒓𝒚.💞\n"
                "-𝒎𝒂𝒓𝒄𝒉.💞\n"
                "𝒂𝒑𝒓𝒊𝒍.💞\n"
                "-𝒎𝒂𝒚.💞\n"
                "-𝒋𝒖𝒏𝒆.💞\n"
                "-𝒋𝒖𝒍𝒚.💞\n"
                "-𝒂𝒖𝒈𝒖𝒔𝒕 .💞\n"
                "-𝒔𝒆𝒑𝒕𝒆𝒎𝒃𝒆𝒓 .💞\n"
                "-𝒐𝒄𝒕𝒐𝒃𝒆𝒓.💞\n"
                "-𝒏𝒐𝒗𝒆𝒎𝒃𝒆𝒓.💞\\n"
                "-𝒅𝒆𝒄𝒆𝒎𝒃𝒆𝒓.💞\n"
                "------\n"
                "-𝐒𝐔𝐍𝐃𝐀𝐘.♡\n"
                "-𝐌𝐎𝐍𝐃𝐀𝐘.♡\n"
                "-𝐓𝐔𝐄𝐒𝐃𝐀𝐘.♡\n"
                "-𝐖𝐄𝐃𝐍𝐄𝐒𝐃𝐀𝐘.♡\n"
                "-𝐓𝐇𝐔𝐑𝐒𝐃𝐀𝐘.♡\n"
                "-𝐅𝐑𝐈𝐃𝐀𝐘.♡\n"
                "-𝐒𝐀𝐓𝐔𝐑𝐃𝐀𝐘.♡"
            )
@iqthon.on(admin_cmd(pattern="المواليد(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "₁₉₉₅\n"
                "₁₉₉₆\n"
                "₁₉₉₇\n"
                "₁₉₉₈\n"
                "₁₉₉₉\n"
                "₂₀₀₀\n"
                "₂₀₀₁\n"
                "₂₀₀₂\n"
                "₂₀₀₃"
            )
@iqthon.on(admin_cmd(pattern="اختصارات1(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "ڪݪخـرا .\n"
                "نجَبـيہ .\n"
                "ۿـا .\n"
                "ـلا .\n"
                "حَياتـჂ̤ .\n"
                "سَـرسَحي .\n"
                "ڪياتۿهۃ .\n"
                "فدوۿهۃ .\n"
                "حَبيبـჂ̤ .\n"
                "حَبيبتـჂ̤ .\n"
                "مَڪدࢪ .\n"
                "حَيوانۿهۃ .\n"
                "ﺂوڪيـۃ .\n"
                "ۿـلو .\n"
                "وَلـჂ̤ .\n"
                "ههههۃ .\n"
                "لَـطيف .\n"
                "لَطيفهۃ .\n"
                "رﯢحـيہ .\n"
                "راحتـჂ̤ .\n"
                "ڪݪبـيہ .\n"
                "ﺂنام .\n"
                "ﺂڪل .\n"
                "طالـ؏ .\n"
                "طالعهۃ .\n"
                "مَۃ ﺂدرჂ̤ .\n"
                "شَڪو ؟ .\n"
                "؏َـليهۃ .\n"
                "؏َـليَك .\n"
                "ﺂوفـٰہ .\n"
                "ﺂمـﯢ؏ .\n"
                "حَبڪـٰہ .\n"
                "حَبجـٰہ .\n"
                "ﺂحـح .\n"
                "يـﺂჂ̤ .\n"
                "بـﺂჂ̤ .\n"
                "نـﺂنـჂ̤ .\n"
                "ﺂبـﯢﺳـہ .\n"
                "ﺂڪࢪط .\n"
                "ﺂ؏ـضـہ .\n"
                "يَـۃ فِـدﯢا\n"
                "ۿـواჂ̤ .\n"
                "ساعۿۃ .\n"
                "دَقيقهۃ .\n"
                "لَحضهۃ .\n"
                "ﺂمـوتہ .\n"
                "غَصيتہ .\n"
                "يـما .\n"
                "قَنـﺂتـჂ̤ .\n"
                "بـۅتـჂ̤ .\n"
                "مݪصَقاتہ .\n"
                "مُسـﺂبقهۃ .\n"
                "ﺂسمـჂ̤ .\n"
                "نتعَࢪفـہ ؟.\n"
                "ࢪاحتـჂ̤ .\n"
                "ﺂنـჂ̤ .\n"
                "رﺂنتـჂ̤ .\n"
                "؏ـشقيہ .\n"
                "وݪيدჂ̤ .\n"
                "بنَيتيہ .\n"
                "طِفݪتيہ .\n"
                "تَـعي .\n"
                "وَݪـيہ .\n"
                "موتبيڪہ .\n"
                "موتبيجہ .\n"
                "موتعَليڪہ .\n"
                "نصعَد ؟.\n"
                "صۅتَڪ .\n"
                "كصۅتِجہ .\n"
                "ﺂبـوسـہ.\n"
                "نَعَست .\n"
                "ﺂجيت.\n"
                " نجَبـჂ̤ .\n"
                "ڪݪزَقہ .\n"
                "نَـعـال .\n"
                "زَࢪبـۿهۃ .\n"
                "زاحفَۿهۃ .\n"
                "حَڪـہ .\n"
                "ﮪـہلاﯠﯠ\n"
                "ههيہلآﯛﯛ\n"
                "أههہـﯠﯠ\n"
                "شنـيہ\n"
                "هآيـہ\n"
                "يـ؏\n"
                "أﯠﯠ؏\n"
            )
@iqthon.on(admin_cmd(pattern="اختصارات2(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "ע\n"
                "ليـشـہٰ \n"
                "مِہטּ\n"
                "مِمـححِـہٰ\n"
                "ههههہ\n"
                "واللــہٰ\n"
                "؏َيـﯠﯢنڪك .\n"
                "رﯠﯢحڪكَ .\n"
                "حتـرﯠﯢحَ .\n"
                "؏َـمرڪك .\n"
                "اﯠﯢفَ . \n"
                "جـمـ؏ـﮫـہ\n"
                "مـبارڪـهـہ\n"
                "ـاٌلحمډ للۿ 💗.\n"
                "مــنــﹻـو \n"
                "آتـرخـصــہ\n"
                "اتمۂــنى\n"
                "ﺎتـﯡب .\n"
                "ﭑحنۿ \n"
                "ﺂﺣﺣَـم .\n"
                "د؏ۛـم .\n"
                "دقـِـِۧيۧقـِـِهہ.\n"
                "ډلينييہَ .\n"
                "ﻏﻏِـادرييہَ .\n"
                "حبچـჂَ̤\n"
                "ٲפـبج \n"
                "حــچي\n"
                "حـاڕِهۃ\n"
                "بـاردۿ`"
            )
@iqthon.on(admin_cmd(pattern="اختصارات3(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "• ھھݪـﯠ\n"
                "• شلـﯛنڪہ\n"
                "• شلـﯛنجهہ\n"
                "• ٲلحـﻣډ للّْهہ\n"
                "• يـٱ ࢪّبـــہ\n"
                "• تـﻣـاﻣـہۧ\n"
                "• زيـنۿۂ\n"
                "• شَـنـﯛ؟\n"
                "• ݪيٓش‏ـہ\n"
                "• ؏ــزهہ\n"
                "• خـࢪّبـہ\n"
                "• يڵهہ ؏ـاديـہ،\n"
                "• شڪډ ؏ـيبـہ\n"
                "• مُـحـࢪّ۾\n"
                "• نـُلـطمـہ\n"
                "• زيـاࢪّهہ\n"
                "• حـࢪّٲ۾\n"
                "• ارگـصـہۧ\n"
                "• ٲسبـحہَۧ\n"
                "• ٲرڪضـہۧ\n"
                "• زاحـفـہۧ\n"
                "• زاحـفـهہۧ\n"
                "• مُـتاحـہ،\n"
                "• مُـتاحۿۂ،\n"
                "• فـاۿيـهہ،\n"
                "• متتـــہ\n"
                "• ؏ـــشقجٰہ\n"
                "• ڪيـيوتـہ\n"
                "• ڪـافــيہۛ\n"
                "• بـ؏ـد \n"
                "• ليـشہ\n"
                "• ۿﮧـﺎ \n"
                "• ـآحنهٰــہ\n"
                "• ؏ـليك\n"
                "• حــب\n"
                "• حــبيہ\n"
                "• ؏ـنيہ\n"
                "• ﮪۛـوِٰاي\n"
                "• ؏ـليۿ\n"
                "• ؏ــيني"
            )
@iqthon.on(admin_cmd(pattern="اختصارات4(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "؏ـليڪ\n"
                "أඋـبڪ\n"
                "أنيہ\n"
                "شبيڪ\n"
                "يڪول\n"
                "لآ\n"
                "بسہ \n"
                "ليشہ\n"
                "أڪرۿڪ\n"
                "أڪول\n"
                "أڪلڪ\n"
                "أڪلج\n"
                "شلونڪ\n"
                "ﺎﻟلهۂَ \n"
                "ﺣــِلاﯛتيہ\n"
                "ٵڪوݪك\n"
                "شــ؏ـليه \n"
                "ٵڪﯙلـﭻ \n"
                "اﻧـييہ \n"
                "פـلوٰ \n"
                "ٵࢪيد \n"
                "ٵࢪوحـہ \n"
                "ا؏ـࢪفہ \n"
                "ٵدࢪيہ \n"
                "آ؏ـشقـجہ \n"
                "ﭑ؏ـشقڪہ \n"
                "تفضـࢦيہ\n"
                "تفضـࢦ\n"
                "פـباببهـہ\n"
                "פـباب\n"
                "פـاسـﯢب\n"
                "آميٰـטּ\n"
                "ﺑـسـہ \n"
                "ضَݪـ؏ـييہ\n"
                "ضَݪـ؏ـتيـہ\n"
                "؏َـندʊ̤\n"
                "ﺂجتمـا؏\n"
                "ٵჂ̤"
            )
@iqthon.on(admin_cmd(pattern="اختصارات5(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "- مٰنۅِ 💕.\n"
                "- شٰخصَ 💕.\n"
                "- مٖتستاۿَݪ 💕.\n"
                "- ﺂݪتحِبۿم 💕.\n"
                "- يديمَݪج 💕.\n"
                "- ﻼَטּَ 💕.\n"
                "- ﺂݪحِبٰ 💕.\n"
                "- شٰݛطَ 💕.\n"
                "- ۈيَاجٖ 💕.\n"
                "- ڪِﯡليٰ 💕.\n"
                "- ؏ـلمِودِ 💕.\n"
                "- ﺂݪطِايٰݛ 💕.\n"
                "- صفٰحۿَہٰ 💕.\n"
                "- ﺂڪِݪتٰ 💕 .\n"
                "- نٰفسَكٰ 💕.\n"
                "- تِݛۿَ 💕.\n"
                "- طٰبيعَيٰ💕.\n"
                "- ڪِݪشيٰ 💕.\n"
                "- صٰديقِتيٰ 💕.\n"
                "- تَفيدكٰ 💕.\n"
                "- ڪٰمݪتِ 💕.\n"
                "- ﺂڪِݪ 💕.\n"
                "- ﺂݛيَدۿَ 💕.\n"
                "- مٖݛيضِۿَہٰ 💕.\n"
                "- ڪِݪتِ 💕.\n"
                "- خَتوݪيٰ 💕.\n"
                "- ݪزِڪٰۿَہٰ 💕.\n"
                "- ڪِافيٰ 💕.\n"
                "- صٰدﺂ؏َ 💕.\n"
                "- ﭑبوٰيۿَ 💕.\n"
                "- مِامَا 💕.\n"
                "- مٖخصِكٰ 💕.\n"
                "- ﺂݪكِ 💕.\n"
                "- ﺎرﯠﯢح ففدوۿَ ﺂݪعمَݛك 💕 .\n"
                "- ﺂتفضِݪ 💕.\n"
                "- ﺂچذبٰ 💕.\n"
                "- ﺂجِيتكٰ 💕.\n"
                "- غيَݛ 💕.\n"
                "- ڪٰيوِتَ 💕.\n"
                "- ﺂنِيٰ 💕.\n"
                "- ﺂحِبۿا 💕.\n"
                "- ﺂشِوفكٰ 💕.\n"
                "- ﺂسݪوِبكٰ 💕.\n"
                "- شٰوڪٰتِ 💕.\n"
                "- ݪوڪٰيہٰ 💕.\n"
                "- ﺂݪظَۿَݛ 💕.\n"
                "- شٰتحِسٰ 💕.\n"
                "- ﺂطِݪقِ💕 . \n"
                "- ﺂڪِوݪك 💕 .\n"
                "- ﺂحِبۿمٖ 💕.\n"
                "- ﺂݪۿِم 💕.\n"
                "- ﺂنشِاݪلۿَ 💕.\n"
                "- ﺂݪمۅفقيۿٰ 💕 . \n"
                "- بٰـﭑჂ̤ 💕 .\n"
                "- بِسرعۿِ 💕.\n"
                "- ﺂڪِوݪج  💕.\n"
                "- ﺂݪفِاضكٰ 💕.\n"
                "- ﺂ؏َـݛفِ 💕.\n"
                "- ح٘قيٰݛ 💕.\n"
                "- ﺂڪَثݛ 💕.\n"
                "- ڪِيبوٰݛد 💕.\n"
                "- بوسَنـჂ̤ 💕 .\n"
                "- تسَݪمينٰ 💕.\n"
                "- פـِبيبَتيٰ 💕.\n"
                "-  ؏ـنِديٰ 💕.\n"
                "- حِݪۅ 💕.\n"
                "- مٖتݪزِكٰ 💕."
            )
@iqthon.on(admin_cmd(pattern="بايو1(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event, "☁️ : 🕊\n" "☁️ :   ✨\n" "☁️ :   🤍\n\n" "بريئۃ ۿي، بصورۿ لطيفۃ ڪالاطفال🎀")
            
@iqthon.on(admin_cmd(pattern="بايو2(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event, "☘️ 💕\n" "☘️ 💕\n" "☘️ 💕\n" "☘️ دمت لي شيئاً جميلاً لا ينتهي💕")
            
@iqthon.on(admin_cmd(pattern="بايو3(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "𓋜┊𓆩 ➝  ˛⁽🇮🇶₎⇣ 𓆪\n"
                "𓋜┊𓆩  𓆪\n"
                "𓋜┊𓆩  𓆪\n"
                "𓋜┊𓆩  𓆪\n"
                "𓋜┊𓆩 ﭑميرۿ ـلآ يُليق بها ﭑلانحنا🍂 𓆪\n"
                "⁞ ωєℓ¢σмє тo му ρяσƒιℓє ⁞"
            )
@iqthon.on(admin_cmd(pattern="بايو4(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event,
                "🜟 ↬ ᑎᗩᗰE ، • •😌❤️\n"
                "🜟 ↬ ᖴᖇOᗰ ، IRΔQ 🇮🇶\n"
                "🜟 ↬ ᗩGE ، y.o ♥️.\n\n"
                "🧿🍃  .....  🧿🍃."
            )
@iqthon.on(admin_cmd(pattern="بايو5(?: |$)(.*)"))
async def _(event):
    await edit_or_reply(event, "𓂅| •\n" "𓂅| •\n" "𓂅| •🖤☁️ .\n" "• 𝙸 𝙻𝙸𝙺𝙴 𝙼𝙾𝚄𝙽𝚃𝙰𝙸𝙼𝚂 𝙽𝙾𝚃 𝙵𝙰𝙻𝙻 .")
@iqthon.on(admin_cmd(pattern="بايوهات1(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""
— — — — — — — — —
`𓆦 : أيـۿ  ◡‌ 💙🧿.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 💙🧿.
𓆦 : انت دائماً بقلبي وأنا دائـماً #أحبك ◡‌ 💙🧿 .`
— — — — — — — — —
`𓆦 : مَريـم  ◡‌ 🤎🦦.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🤎🦦.
𓆦 : أنت فرحة عُـمري أنت #أصدق شعور ◡‌ 🤎🦦 .`
— — — — — — — — —
`𓆦 : بَنيـن  ◡‌ 💛🍋.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 💛🍋.
𓆦 : ‏تسـرني إذا مريت في #بالي ◡‌ 💛🍋 .`
— — — — — — — — —
`𓆦 : ۿبـة  ◡‌ 🤍🕊.
𓆦 : ذأت الـ ٢١ ؏ـام ◡‌ 🤍🕊.
𓆦 : ‏لتكُن أصـابعي #بأمان يديك دائماً ◡‌ 🤍🕊 .`
— — — — — — — — —
`𓆦 : ﺄيـة  ◡‌ 🎈.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🎈.
𓆦 : ‏ماياخذوُنك منَي مهما #زعلنا وأخذنا البُعد ‏ ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : شۿـد  ◡‌ 🎈.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 🎈.
𓆦 : ‏ ‏اتمنى أن تمتلك عذراً كافٍ لكل ما تفعله معي حتى الآن . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : زۿـࢪأء  ◡‌ 🎈.
𓆦 : ذأت الـ ١٥ ؏ـام ◡‌ 🎈.
𓆦 : ‏ #حَسباليّ تحِن تاليتك بسابعّ حضن . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : مـينآ  ◡‌ 🎈.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🎈.
𓆦 : ‏ كافي تكابر #عيونك حچن حزنك . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : ࢪوأن  ◡‌ 🎈.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 🎈.
𓆦 : ‏إذا اعتنيت #بالاشياء ، فهي تدوم .  ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : رزﺄن  ◡‌ 🍇.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 🍇.
𓆦 : الوطن ليس مكان بل #انت  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : سَـارۿ  ◡‌ 🍇.
𓆦 : ذأت الـ ٢٠ ؏ـام ◡‌ 🍇.
𓆦 : اعَرف اجرح بلكِلام بسہِ الرفقَ #بالحيوان واجَب  ◡‌ 🍇.``
— — — — — — — — —
`𓆦 : سَـجى  ◡‌ 🍇.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 🍇.
𓆦 : اگدر اهين #كرامتك بَس أني ماگدر اهين شي مموجود اصلاً  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : فَـرح  ◡‌ 🍇.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🍇.
𓆦 : ذيل الجلب عمره مَ #ينـ؏ـدل  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : رؤأن  ◡‌ 🍇.
𓆦 : ذأت الـ ١٨ ؏ـام ◡‌ 🍇.
𓆦 : تُبچيني اغنية عن ايَ #قساوة تحچون؟  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : زۿـݛأء  ◡‌ 💞💌.
𓆦 : ذأت الـ ١٧ ؏ـام ◡‌ 💞💌.
𓆦 : وإنك كـل مَا أحب فِي هذه #الحياة ◡‌ 💞💌.`
— — — — — — — — —
`𓆦 : مَـ؏ـشۈقته ◡‌ 🦌💞.
𓆦 : ذآت ﺄلـ  ١٦ ؏َـام ◡‌ 🦌💞.
𓆦 : - أسافِر والأغانـي لـوجهَك #تردنـي ◡‌ 🦌💞.`

— — — — — — — — —
`𓆦 : بنَيتـۿ ◡‌ 🍋🌿.
𓆦 : ذآت ﺄلـ  ٢٠ ؏ـام ◡‌ 🍋🌿.
𓆦 : - إتباهـاا بيِّڪ هوايـَْه يَسمر #يحـلو ◡‌ 🍋🌿.`

— — — — — — — — —
`𓆦 : مݛيتـۿ ◡‌ 🤍💧.
𓆦 : ذآت ﺄلـ ١٨ ؏ـام ◡‌ 🤍💧.
𓆦 : - عينـاكَ بحر ومـا ڪان الغريـق الاَّ #أنـا ◡‌ 🤍💧.`

— — — — — — — — —
""")
@iqthon.on(admin_cmd(pattern="بايوهات2(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""
⠀⠀                
⠀ ⠀ ⠀⠀⠀`. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 نحن ڪـ الفرص لا نأتي مرتين 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔ `

— — — — — — — — —⠀ ⠀
 ⠀⠀      ⠀⠀    ⠀ `- 𝟪.𝟣𝟨 𝑚𝑎𝑟𝑐ℎ 🕊: 
 ⠀⠀⠀⠀     - 𝑓𝑟𝑜𝑚 . . 𝐼𝑟𝑎𝑞 𝑏𝑎𝑔ℎ𝑑𝑎𝑑 📌.
       -رقيقـٰۿۃ‏ ڪہ ٱجنحۿۃ‏ ٱلفراشۿۃ‏🦋 `⠀⠀⠀⠀

— — — — — — — — —⠀⠀             ⠀⠀⠀ ⠀⠀⠀ 
⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀ ` ❲ 21 𝒚.𝒐 ❳
     ⠀⠀         ⠀⠀• َ𝒊𝒏 • 𝒃𝒂𝒈𝒉𝒅𝒂𝒅 ❄️  .
-ء ୪ أُعَوَّض ୪ ꪆ أُسَتبدَل ୪ ꪆ أُقارَن✋🏼. 📨!. `    
⠀⠀  ⠀⠀⠀   

— — — — — — — — —⠀⠀ ⠀ ⠀
 ⠀⠀        ⠀       `- :17y.o. 
                    - : 𝑖𝑛 iraq 🇮🇶. 
 ⠀⠀       كَـ حبة المَـطر، رقـيقة ☁️ . 
• 𝙻𝙸𝙺𝙴 𝙰 𝚁𝙰𝙸𝙽𝙳𝚁𝙾𝙿, 𝚃𝙷𝙸𝙽 . ❤️.`
  ⠀⠀         

— — — — — — — — —
 ⠀⠀ ⠀` - 𝒊𝒏 #Basra
 ⠀⠀     - ℒ𝒐𝒗𝒆 𝒎𝒚 𝒔𝒆𝒍𝒇
 ⠀⠀ ⠀ -  • أنيــــہ الإستثنائيـۃ  ، المختلفـۃ 🖤❕`

— — — — — — — — —⠀ ⠀ ⠀
 ⠀⠀      ⠀⠀    ⠀ `- 𝟒: 𝟏𝟏🏷: 
 ⠀⠀⠀⠀     -  𝐼𝑟𝑎𝑞: 𝐚𝐫𝐩𝐢𝐥🍂.
     - ﭑنـا بزوديَ ارتفع محد يعليني .` ⠀⠀⠀⠀

— — — — — — — — —⠀⠀             ⠀⠀⠀ ⠀⠀⠀ 
⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀ ` ❲ 01:23 ❳
     ⠀⠀         ⠀⠀- 𝐼𝑛 : 𝐷ℎ𝑖 𝑄𝑎𝑟 .
-يڪرهونَـيَ، وَيقلدون ﭑلمشـي الآمشيُـهہۛ 📨!. `    
⠀⠀  ⠀⠀⠀   

— — — — — — — — —
`‎  ‌‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎ ‎ 𐄐 𝓑𝗮𝗴𝗵𝗱𝗮𝗱 🇮🇶 ⸃.
 ‎  .❕ ۿادئۃ مُتصالحۃة مع ڪل شيئَ : 
 ‎  ‎  ‎  ‌‎ ‎  ‎  ‎  ‎  ‎  ‎ ‎  ‎  ‎  𐄐 ‎ 𝟭𝟴  𝗬.𝗢 ⌝.`

— — — — — — — — —⠀ 
                ⠀⠀⠀⠀⠀    `˹ ↯  .
            ❥ ғʀᴏᴍ ɪʀᴀǫ 🇮🇶✿
    - هادئۿۃ‏، #قويۿۃ‏، جميلۿۃ‏، وحيدۿۃ‏🐆.`
          

— — — — — — — — —⠀⠀                
⠀ ⠀ ⠀⠀`⠀. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 قـآتل مُـن ٱجل حلـمڪٰ دائما 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔`

— — — — — — — — —
⠀ ⠀ ⠀⠀`⠀. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 نحن ڪـ الفرص لا نأتي مرتين 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔`
⠀

— — — — — — — — —

⠀` ‌⠀ ‌⠀ ‌ ⠀⠀ ⠀⠀ ‌   .𓆸 #𝘋𝘪𝘺𝘢𝘭𝘢 𑁍.
‌ ⠀ ‌ ⠀ ‌ ⠀ ‌ ⠀ - 𝘐 𝘯𝘦𝘦𝘥 𝘢 𝘯𝘦𝘷𝘦𝘳 𝘦𝘯𝘥𝘪𝘯𝘨 𝘩𝘶𝘨 .
‌ ⠀ ‌ ⠀ ‌ ⠀ ‌‌ ‌ ⠀ ⠀‌       .⧼ 𝟤𝟶𝟶𝟥 ☆. ⧽.`

— — — — — — — — —
""")            
